app/views/api/v1/talks/index.json.jbuilder

  # Mostra a data da última mensagem trocada
  json.date talk.messages.first.created_at if talk.messages.count >= 1
---
SELECT COUNT(*) FROM "messages" WHERE "messages"."talk_id" = $1  [["talk_id", 41]]