app/views/api/v1/talks/messages.json.jbuilder

SELECT "messages".* FROM "messages" WHERE "messages"."talk_id" = $1 ORDER BY created_at DESC  [["talk_id", 107]]
---
  json.messages do
    json.array! @api_v1_talks.messages.order("created_at DESC") do |message|