app/controllers/api/v1/properties_controller.rb

  def autocomplete
    results = []

    Property.where(status: :active).each do |property|
---
SELECT "properties".* FROM "properties" WHERE "properties"."status" = $1  [["status", 0]]

  def add_to_wishlist
    begin
      @api_v1_property.wishlists.find_or_create_by(user: current_api_v1_user)
---
INSERT INTO "wishlists" ("user_id", "property_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["property_id", 1], ["created_at", 2017-01-19 16:35:13 UTC], ["updated_at", 2017-01-19 16:35:13 UTC]]
SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."property_id" = $1 AND "wishlists"."user_id" = 1 LIMIT $2  [["property_id", 1], ["LIMIT", 1]]

  def remove_from_wishlist
    begin
      @api_v1_property.wishlists.find_by(user: current_api_v1_user).delete
---
DELETE FROM "wishlists" WHERE "wishlists"."id" = $1  [["id", 2]]
SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."property_id" = $1 AND "wishlists"."user_id" = 5 LIMIT $2  [["property_id", 3], ["LIMIT", 1]]

  def hot_properties
    properties = []
    begin
      Property.where(priority: true, status: :active).order("RANDOM()").limit(1).each{ |p| properties << p }

      end_date = Time.new
      begin_date =  end_date - (60 * 60 * 24 * 10)
      most_visited = Visitor.where(created_at: begin_date..end_date).order("RANDOM()").group(:property_id).count.take(10).first
      # Without '[0]' the query return [:property_id, count_all]
      properties << Property.find(most_visited[0]) unless most_visited.nil?

      missing = 3 - properties.count

      Property.where(status: :active).order("RANDOM()").limit(missing).each{ |p| properties << p } if missing > 0
---
SELECT  "properties".* FROM "properties" WHERE "properties"."status" = $1 ORDER BY RANDOM() LIMIT $2  [["status", 0], ["LIMIT", 1]]

    def set_api_v1_property
      @api_v1_property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]