app/controllers/api/v1/talks_controller.rb

  def index
  	page  = (params[:page])? params[:page] : 1

  	@talks = Talk.includes(:messages)
  		.joins(:property)
  		.where(["properties.user_id = ? or talks.user_id = ?", current_api_v1_user.id, current_api_v1_user.id])
  		.group("talks.id, messages.created_at, messages.id")
  		.order("messages.created_at DESC")
  		.paginate(:page => page, :per_page => 8)
---
SELECT  DISTINCT "talks"."id", messages.created_at AS alias_0 FROM "talks" INNER JOIN "properties" ON "properties"."id" = "talks"."property_id" LEFT OUTER JOIN "messages" ON "messages"."talk_id" = "talks"."id" WHERE (properties.user_id = 125 or talks.user_id = 125) GROUP BY talks.id, messages.created_at, messages.id ORDER BY messages.created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 8], ["OFFSET", 0]]

  def create_message
    begin
      if params[:id]
        set_api_v1_talks
      elsif params[:property_id]
        @api_v1_talks = Talk.create(property: Property.find(params[:property_id]), user: current_api_v1_user)
      else
        raise "Without the correct parameters"
      end

      @api_v1_talks.messages << Message.create(body: params[:body], user: current_api_v1_user)
---
INSERT INTO "talks" ("user_id", "property_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 777], ["property_id", 328], ["created_at", 2017-03-05 17:05:11 UTC], ["updated_at", 2017-03-05 17:05:11 UTC]]
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 328], ["LIMIT", 1]]
SELECT  "talks".* FROM "talks" WHERE "talks"."id" = $1 LIMIT $2  [["id", 159], ["LIMIT", 1]]
INSERT INTO "messages" ("body", "user_id", "talk_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "ad"], ["user_id", 769], ["talk_id", 159], ["created_at", 2017-03-05 17:05:10 UTC], ["updated_at", 2017-03-05 17:05:10 UTC]]

	  def set_api_v1_talks
	  	@api_v1_talks = Talk.find(params[:id])
---
SELECT  "talks".* FROM "talks" WHERE "talks"."id" = $1 LIMIT $2  [["id", 97], ["LIMIT", 1]]