app/controllers/api/v1/users_controller.rb

SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = $1  [["user_id", 18]]
---
  def wishlist
    @api_v1_properties = current_api_v1_user.wishlists.map {|w| w.property}

UPDATE "users" SET "name" = $1, "photo" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Hannah Fritsch"], ["photo", "file.png"], ["updated_at", 2017-01-12 04:15:40 UTC], ["id", 17]]
INSERT INTO "addresses" ("country", "state", "city", "neighborhood", "street", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def update
    @user = current_api_v1_user
    begin
      if params[:address]
        if @user.address.present?
          @user.address.update(address_params)
        else
          @user.update(address: Address.create(address_params))