app/views/api/v1/properties/_api_v1_property.json.jbuilder

SELECT "photos".* FROM "photos" WHERE "photos"."property_id" = $1  [["property_id", 46]]
---

  json.photos api_v1_property.photos.map {|p| p.photo.url}